<?php
/* 橘子科技旗下 A4源码所有  https://an4.net 搭建二开联系 QQ 3479863005  纸飞机联系 @orangetech */

// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 自定义公共配置
// +----------------------------------------------------------------------

return [
	// 天天国际短信平台
	'ttSMSSet' =>[
		'account'	=> 'jason001',		// 账号
		'pwd'		=> 'qqqq123456',	// 密码
		'ServiceID' => 'SEND'			// 固定，不需要改变
	],
	
	// 充值参数
	'rechargeSet'	=> [
		'fee'	=> 0.001,		// 充值手续费收款比例
	],
	
	// VIP设置
	'vipSet'	=> [
		1	=> ['name'=>'普通会员', 'recharge_amount'=>0,   'taskNumber'=>3],
		2	=> ['name'=>'主播', 	 'recharge_amount'=>300, 'taskNumber'=>10],
		3	=> ['name'=>'网红', 	 'recharge_amount'=>600, 'taskNumber'=>20],
		4	=> ['name'=>'明星', 	 'recharge_amount'=>1000,'taskNumber'=>35],
		5	=> ['name'=>'奥斯卡',  'recharge_amount'=>3000,'taskNumber'=>108],
	],
	
	
];
